{
  "contact": {
    "email": "jenna@jennapalmer.info",
    "cell": "3142212451"
  },
  "sections": [
    {
      "key": "landing",
      "label": "Landing",
      "inMenu": false,
      "title": "Hi, I'm Jenna Palmer",
      "action": {
        "text": "Check my work",
        "link": "#experience"
      },
      "image": "profile.jpg",
      "description": [
        "I am many things in this life: a writer, a speaker, a mentor, an artist, but most importantly - I am a Senior Software Engineer with full-stack specialty in creating wholistic and modern Web Applications."
      ]
    },
    {
      "key": "about",
      "label": "About",
      "title": "Who am I?",
      "inMenu": true,
      "description": [
        "My career began as an Analyst for a National Consulting company, providing insights and well-written code to many high-profile clients such as Bayer (Monsanto), Charter, and more. As my career evolved, I was privileged enough to be brought into Nike's digital ecosystem dealing with technologies that recieve over 1k user transactions a second and enabled Nike to present customized user experienced via their login with their Nike account.",
        "Nowadays, I continue to work on high-traffic, high-impact product and thrive in fast-paced and collaborative environments. On any given day, you'll likely find me desk-dancing to my favorite tunes while churning out code that makes engineers and people's lives easier. Accessibility, and resuability are my two passions - and combined with my fire for mentorship, I often find myself collaborating with junior engineers and senior engineers alike to create complete and well-rounded applications."
      ],
      "subSection": {
        "education": [
          {
            "key": "webster",
            "location": "St. Louis, MO",
            "school": "Webster University",
            "degree": "B.S. in Computer Science",
            "timeline": {
              "start": "2014",
              "end": "2017"
            }
          }
        ]
      }
    },
    {
      "key": "skills",
      "label": "Skills",
      "title": "Here are my skills & frameworks",
      "description": [
        "I like to consider myself a jack-of-all-trades. While I have specialties with a variety of frontend languages, there's no challenge too big for me to tackle."
      ],
      "inMenu": true,
      "subSection": {
        "skills": {
          "categories": [
            {
              "key": "soft-skills",
              "label": "Soft Skills"
            },
            {
              "key": "languages",
              "label": "Languages"
            },
            {
              "key": "frontend",
              "label": "Frontend Engineering"
            },
            {
              "key": "backend",
              "label": "Backend Engineering"
            },
            {
              "key": "testing",
              "label": "Testing Frameworks"
            }
          ],
          "data": [
            {
              "key": "docker",
              "label": "Docker",
              "url": "https://www.docker.com",
              "category": "backend"
            },
            {
              "key": "airflow",
              "label": "Apache Airflow",
              "url": "https://airflow.apache.org/",
              "category": "backend"
            },
            {
              "key": "aws",
              "label": "Amazon Web Services",
              "url": "https://aws.amazon.com/",
              "category": "backend"
            },
            {
              "key": "typescript",
              "label": "Typescript",
              "url": "https://www.typescriptlang.org/",
              "category": "languages"
            },
            {
              "key": "kubernetes",
              "label": "Kubernetes",
              "url": "https://kubernetes.io/",
              "category": "backend"
            },
            {
              "key": "mui",
              "label": "Material UI",
              "url": "https://mui.com/",
              "category": "frontend"
            },
            {
              "key": "node",
              "label": "Node.js",
              "url": "https://nodejs.org/en/about/resources/",
              "category": "backend"
            },
            {
              "key": "react",
              "label": "React.js",
              "url": "https://reactjs.org/",
              "category": "frontend",
              "subtitle": "(Native, Class-based, Functional)"
            },
            {
              "key": "vue",
              "label": "Vue.js",
              "url": "https://vuejs.org/",
              "category": "frontend"
            },
            {
              "key": "communication",
              "label": "Communication",
              "category": "soft-skills"
            },
            {
              "key": "leadership",
              "label": "Leadership",
              "category": "soft-skills"
            },
            {
              "key": "decision-making",
              "label": "Decision Making",
              "category": "soft-skills"
            },
            {
              "key": "mentorship",
              "label": "Mentorship",
              "category": "soft-skills"
            },
            {
              "key": "javascript",
              "label": "JavaScript",
              "category": "languages"
            },
            {
              "key": "html",
              "label": "HTML(5)",
              "category": "languages"
            },
            {
              "key": "css",
              "label": "CSS(3)",
              "category": "languages"
            },
            {
              "key": "python",
              "label": "Python",
              "category": "languages"
            },
            {
              "key": "state-management",
              "label": "State Management",
              "subtitle": "(Redux, Recoil, Atom, Vuex, etc.)",
              "category": "frontend"
            },
            {
              "key": "angular",
              "label": "Angular",
              "category": "frontend"
            },
            {
              "key": "jest",
              "label": "Jest",
              "category": "testing"
            },
            {
              "key": "react-testing-library",
              "label": "React Testing Library",
              "category": "testing"
            },
            {
              "key": "mocha",
              "label": "Mocha",
              "category": "testing"
            },
            {
              "key": "cypress",
              "label": "Cypress",
              "category": "testing"
            },
            {
              "key": "selenium",
              "label": "Selenium",
              "category": "testing"
            }
          ]
        }
      }
    },
    {
      "key": "testimonials",
      "label": "Testimonials",
      "title": "Testimonials",
      "inMenu": true,
      "description": [
        "Magna voluptate Lorem adipisicing esse culpa Lorem elit occaecat officia exercitation dolor excepteur esse aliquip. Anim velit nisi laboris in reprehenderit excepteur officia Lorem dolore."
      ],
      "subSection": {
        "quotes": [
          {
            "quote": "Jenna is precisely the kind of person I welcome on a project. She is respectful of other peoples ideas and unafraid to offer her own suggestions and insights. While she is quick to take on responsibility, she is also quick to ask for help when roadblocks arise. I know I can count on her to be truthful, honest and open during retrospectives. Any team is made brighter by Jenna's participation.",
            "person": "Richard D.",
            "title": "Co-worker at Slalom Consulting LLC (St. Louis)"
          },
          {
            "quote": "Jenna loves programming. She is passionate about her career and does what she loves every day. You see this in her work. She has never been overly confident but is truly fearless while attempting anything you set in front of her. I have never seen her give up on a problem she has faced.",
            "person": "Nick D.",
            "title": "Mentor at Slalom Consulting LLC (St. Louis)"
          },
          {
            "quote": "You were able to jump into a project mid-flight, grasp the task at hand, and helped us deliver a quality product to our client on time, meeting the client's initial expectation which had become out of scope due to budget cuts. She is a great teammate and brings her true self to work, making coming to work that much more of a pleasure.",
            "person": "Curtis M.",
            "title": "Co-worker at Slalom Consulting LLC (St. Louis)"
          },
          {
            "quote": "[Jenna receives] feedback openly and without defensiveness. … She demonstrates a creator mindset, focused on the outcome she wants to achieve. … I have a lot of confidence in [her] ability to achieve [her] development goals and have a successful career in consulting based on the behaviors I have seen.",
            "person": "Kristin R.",
            "title": "Co-worker at Slalom Consulting LLC (Portland)"
          }
        ]
      }
    },
    {
      "key": "experience",
      "label": "Work Experience",
      "inMenu": true,
      "title": "Checkout my work experience",
      "description": [
        "Working on high-impact, high-traffic products is my specialty, and I'm ready to take your current user experience to the next level. Check out my experience at each of these companies and see how my skillset can best benefit your current environment."
      ],
      "subSection": {
        "experience": [
          {
            "title": "Sr. Software Engineer",
            "employer": "Alaska Airlines",
            "team": "Create Reservation",
            "organization": "E-Commerce",
            "location": "Portland, OR",
            "description": [
              "I currently work on Alaska Airlines's most revenue impacting team - the Booking Team. We manage the entire user experience post clicking the 'checkout' button.",
              "This means we're responsible for everything including: booking the flight, enabling them to select seats, accepting user payment, viewing ticket restrictions and limitations, and lastly providing customers with their confirmation number and additional information so they're confident their flight was booked.",
              "While on this team, I also contributed significantly to this project's re-write. Previously written in a monolithic C# MVC applicaiton, Alaska's modernization investment has lead them to pursue a micro-site format going forward in order to enable faster and more well-rounded user experiences."
            ],
            "bullets": [
              "Worked on the product responsible for booking and accepting payment for all flights going through Alaska Airlines ",
              "Participated in the project's re-write and moved functionality from a C# monolithic application to a micro-site format.",
              "Utilized Next.js and React in a Test-Driven Development environment, and pair regularly",
              "Worked with onboarding engineers, and mentored the junior engineers on the team."
            ],
            "icon": "alaska",
            "timeline": {
              "start": "Feb 2022",
              "end": "Aug 2022"
            }
          },
          {
            "title": "Software Engineer II",
            "employer": "Nike",
            "team": "Managed Airflow Platform",
            "organization": "Engineered Platforms",
            "location": "Beaverton, OR",
            "description": [
              "Working in Nike's Engineered Platform space, I enabled Data Scientists to securely launch and utilize Apache Airlfow clusters in a monitored and secure AWS EKS environment.",
              "Known as the Managed Airflow Platform (MAP), this team was responsible fo ensuring all internal clusters created were operational and active. This meant I was constantly in support discussions with customers, assisting them in the creation of their Docker images and utilization of our EKS deployment pipeline.",
              "On this team, I was also the Subject Matter Expert regarding their EKS Service's frontend application. In this role, I utilized my React Expertise and leadership skills to assist the Product Owner in determining new feature capabilities, upgrading our frontend bug tracking methods, and also personally spearheaded an operation to onboard 30+ offshore engineers in order to assist in our support needs."
            ],
            "bullets": [
              "Maintained the product responsible for assisting Data Scientists in creating and maintaing data pipelines via the Apache Airflow product; known as the Managed Airflow Platform.",
              "Supported internal Nike engineers in resolving their faulty Airflow Cluster configurations and MAP-product related bugs; Includes meeting with customers and stakeholders often to work on platform stability related work.",
              "Created new features, components, and tests in the React.js application used by the Data Engineers to monitor their Airflow Cluster stats.",
              "Implemented new features onto the MAP Product such as: allowing customers to create clusters on China AWS Servers; allow default fields upon cluster creation; streamlined UI with bug fixes and new component additions, designed and launched slack-based app that allowed the team to track support threads via emojis."
            ],
            "icon": "nike",
            "timeline": {
              "start": "Feb 2022",
              "end": "Aug 2022"
            }
          },
          {
            "title": "Technology Consultant",
            "employer": "Slalom Consulting",
            "location": "Portland OR, OR",
            "description": [
              "At Slalom Portland I worked on a variety of projects including: establishing a client's new Security Architecture, Data Migration, and more.",
              "Check out each of the projects I worked on below for more information."
            ],
            "bullets": [
              "Assisted clients in planning their COVID-19 strategy for technical growth during the pandemic. Notated key pressure points clients were facing as they worked through their newly remote workforce. Also brainstormed solutions to their business problems.",
              "Designed a security architecture model for an internal, Tableau-based reporting system that allowed the client to stop outsourcing their reporting needs to other companies",
              "Migrated client applications and data from Ubuntu 14 servers to Ubuntu 16 servers utilizing AWS and CloudFormation scripts."
            ],
            "icon": "slalom",
            "timeline": {
              "start": "Feb 2022",
              "end": "Aug 2022"
            },
            "projects": [
              {
                "industry": "Software as a Service Industry",
                "title": "Server Upgrade & Data Migration",
                "description": [
                  "Worked for a client who's security platform is one of the most popular SSO tools in the world. I facilitated the manual upgrade of each of their client applications from running on Ubuntu 14 servers, to Ubuntu 16 services via the use of Cloudformation scripts.",
                  "Ensured that customer outages while in migration were communicated as expected, and ensured that all data was properly transferred and copied post-migration. Also debugged failed migration tasks, and worked to restore services before the end of the Outage window came."
                ],
                "icon": "security"
              },
              {
                "industry": "Healthcare Industry",
                "title": "Security Architecture",
                "description": [
                  "Worked with our client on their upcoming project to cease use of a vendor's dashboarding tools in order to replace it with their own custom Tableau-based dashboard tooling.",
                  "Ensured all data passed into this new Tableau platform had all the proper security architecutre in place it needed in order to legally protect all Personal Health Information being stored."
                ],
                "icon": "healthcare"
              }
            ]
          },
          {
            "title": "Software Engineer II",
            "employer": "Nike",
            "location": "Beaverton, OR",
            "description": [
              "Worked on Nike's Login & Registration Team and maintained their public Web SDK which enabled internal and external users alike to add 'Sign in with Nike' capabilities to their web pages.",
              "Maintained their existing Vanilla Javascript Web SDK, and contributed to the project re-write written in primarily React.js with NGINX working to map API calls to the right backend services.",
              "Also provided on-site support for major shoe launches in order to ensure all bot traffic was properly mitigated, and login rates remained steady."
            ],
            "bullets": [
              "Maintained Nike's public Web SDK responsible for enabling 'login with Nike' capabilities to both internal and affiliated websites.",
              "Developed new product features in JavaScript and deployed to AWS-based production environment, utilizing Nike's Jenkins Pipeline solution (BMX), and monitored those deployments using New Relic analytics.",
              "Contributed to the project re-write as they transition from a vanilla JavaScript application to React.js; wrote End-to-End (E2E), Unit, and Integration tests for all contributed code.",
              "Personally encouraged accessible solutions in the re-write, and contributed to the addition of an accessibility library and testing suite into the new project's codebase.",
              "Worked with Apple-Affiliated engineers to integrate 'Sign in with Apple' UI into mobile versions of the SDK.",
              "Provided live, on-site support for large shoe launches on Nike.com to ensure bot traffic was appropriately mitigated and the login success rates remained steady."
            ],
            "team": "Login & Registration",
            "icon": "nike",
            "organization": "Nike Digital",
            "timeline": {
              "start": "Feb 2022",
              "end": "Aug 2022"
            }
          },
          {
            "title": "Technology Consultant",
            "employer": "Slalom Consulting",
            "location": "St. Louis, MO",
            "description": [
              "Worked on a number of high-profile clients, providing them with top-tier software engineering solutions to their existing business problems.",
              "Check out each of the projects I worked on below for more information."
            ],
            "bullets": [
              "Developed mobile application in React Native to provide the client's customers with more detailed, weather-based recommendations regarding the application of a federally regulated pesticide. App is RXXtend Spray by Bayer AG and is available on the Google and App Store.",
              "Designed and created custom Vue components utilized in an AEM-environment. Also, hosted an educational session on the best practices of Git Management and Git Flow to ensure new design system was maintained properly.",
              "Utilized Google Maps API and microservices to display the national status of the client's telecommunication hubs across the US in an easy-to-use, map-based dashboard written in Angular 2.0. Implemented logic on real-time data as it appeared on the map, to visually show when outages increased or decreased.",
              "Participated and hosted Agile ceremonies with my teammates and demonstrated my work to the client's Product Owners on a weekly basis."
            ],
            "icon": "slalom",
            "timeline": {
              "start": "Feb 2022",
              "end": "Aug 2022"
            },
            "projects": [
              {
                "industry": "Agriculture Industry",
                "title": "Mobile Application Development",
                "description": [
                  "Developed mobile application in React Native to provide the client's customers with more detailed, weather-based recommendations regarding the application of a federally regulated pesticide. App is RXXtend Spray by Bayer AG and is available on the Google and App Store.",
                  "Specifically created the 'new user onboarding' flow experienced when downloading the app for the first time. Also added new features to the map-based weather program, and ensured tests were written and functioning for all app capabilities."
                ],
                "icon": "agriculture"
              },
              {
                "industry": "Agriculture Industry",
                "title": "Design System & Components",
                "description": [
                  "Designed and created custom Vue components utilized in an AEM-environment. Also, hosted an educational session on the best practices of Git Management and Git Flow to ensure new design system was maintained properly.",
                  "Also ensured that each of these Vue components had dynamic styling, enabling them to be used on each of the client's 50+ websites that had their own style and branding."
                ],
                "icon": "agriculture"
              },
              {
                "industry": "Telecommunications Industry",
                "title": "Map-based Dashboard",
                "description": [
                  "Utilized Google Maps API and microservices to display the national status of the client's telecommunication hubs across the US in an easy-to-use, map-based dashboard written in Angular 2.0. Implemented logic on real-time data as it appeared on the map, to visually show when outages increased or decreased.",
                  "Personally presented this new application to this telecom giant's executive leadership board, and we all witnessed together as a hurricane hit Florida (circa 2018) and saw our app properly indicate a live increase in outages in that area.",
                  "Before this application, executive leadership had no previous way to view all active status of each of the hubs they owned across america; this tool was the first of its kind, and is proudly displayed 24/7 on a monitor in the Executive Leadership's Headquarters."
                ],
                "icon": "telecom"
              },
              {
                "industry": "Internal",
                "title": "Start Haus Program",
                "description": [
                  "Participated in Slalom's flagship 'Start Hau's program, a mini boot-camp built in order to give recent graduates (of bootcamps and universities alike) the skills they need in order to become billable on client sites within 6 months time.",
                  "Worked alongside fellow Star Haus students in getting up to speed on Agile basics, how to lead meetings, testing strategies, must-know algorithms, data structures, and more.",
                  "Graduated Start Haus and became billable on client sites at 4 months post-hire."
                ],
                "icon": "internal"
              }
            ]
          }
        ]
      }
    },
    {
      "key": "contact",
      "label": "Contact Me",
      "title": "Need to get in touch?",
      "inMenu": true,
      "description": [
        "I would love to hear from you and see how you believe my skillset might benefit the current environment you're cultivating at your company. My contact information is listed below, so let's get in touch."
      ]
    },
    {
      "key": "gallery",
      "inMenu": true,
      "subSection": {
        "gallery": [
          "pexels-ekaterina-bolovtsova-4049791",
          "pexels-ekaterina-bolovtsova-4049870",
          "pexels-ekaterina-bolovtsova-4049876"
        ]
      }
    },
    {
      "key": "resume-description",
      "inMenu": false,
      "description": [
        "I am a Senior Full-stack Software Engineer with experience from a variety of enterprise level work environments. My strengths lie in Application Development, specifically Web Application Development, however I'm also well versed in tools that require significant backend knowledge.",
        "I thrive in environments that have a focus on collaboration, test-driven development, and forward thinking. Agile and SCRUM Environments are quite familiar to me, and I'm comfortable leading regular agile ceremonies should the need arise. My career growth plans include becoming a stronger leader within my team, being a Subject Matter Expert in the product I serve, and mentoring the next generation of engineers."
      ]
    },
    {
      "key": "resume-extras",
      "inMenu": false,
      "description": [
        "Participated in, and won, Alaska Airline's Summer Hackathon 2022 with an idea that would increase user accessibility during their airport boarding process.",
        "Volunteer regularly with DevelopThis via helping them with their product building, attending regular meetups, and mentoring junior engineers 1:1.",
        "Was given 6 internal accolades during my time on Nike's MAP Team; Efforts stemmed from my leadership in onboarding 30+ members collectively from our newly adopted offshore team. Met with project management regularly to ensure their onboarding was going smoothly, and within 2 months they were able to relieve a significant portion of support inquiries from the MAP team engineers.",
        "Minored in Spanish and Data Analytics."
      ]
    }
  ]
}
